app/controllers/bears_controller.rb

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def show
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @bear = Bear.new(bear_params)
    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "bear"], ["created_at", "2016-02-01 16:37:09.029186"], ["updated_at", "2016-02-01 16:37:09.029186"]]

  def edit
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @bear = Bear.find(params[:id])
    if @bear.update(bear_params)
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "bears" SET "description" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["description", "bear edit"], ["updated_at", "2016-02-01 16:45:14.453493"], ["id", 3]]

  def destroy
    @bear = Bear.find(params[:id])
    if @bear.destroy
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]